app/controllers/stories_controller.rb

    def index
        @stories = Story.order('created_at DESC')
---
SELECT "stories".* FROM "stories"  ORDER BY created_at DESC

    def like
        without_tracking do
            @story.increment!(:likes)
        end
        @story.create_activity :like
---
UPDATE "stories" SET "likes" = ?, "updated_at" = ? WHERE "stories"."id" = ?  [["likes", 1], ["updated_at", "2016-05-04 18:32:55.066542"], ["id", 1]]
INSERT INTO "activities" ("key", "trackable_id", "trackable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["key", "story.like"], ["trackable_id", 1], ["trackable_type", "Story"], ["created_at", "2016-05-04 18:32:55.075909"], ["updated_at", "2016-05-04 18:32:55.075909"]]

    def create
        @story = Story.new(story_params)
        if @story.save
---
INSERT INTO "stories" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hey this is a TEST!!!"], ["body", "My first post... Hello, world!"], ["created_at", "2016-05-04 18:12:07.645753"], ["updated_at", "2016-05-04 18:12:07.645753"]]

    def find_story
        @story = Story.find(params[:id])
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 1]]

    def load_activities
        @activities = PublicActivity::Activity.order('created_at DESC').limit(20)
---
SELECT  "activities".* FROM "activities"  ORDER BY created_at DESC LIMIT 20